.artifacts/m3/read-profile-20260815-1927/load.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  12 secs]  0 threads 25 conns:    17397632 ops, 1324495 (avg: 1449477) ops/sec, 103.44MB/sec (avg: 113.20MB/sec),  1.21 (avg:  1.10) msec latency

4         Threads
25        Connections per thread
12        Seconds


ALL STATS
==============================================================================================================================
Type           Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
------------------------------------------------------------------------------------------------------------------------------
Json.gets   1449408.66         0.00         0.00         1.10223         1.06300         1.87100         2.84700    115909.02 
Totals      1449408.66         0.00         0.00         1.10223         1.06300         1.87100         2.84700    231818.04